{"class_name": "Model", "config": {"name": {"selected_celltype": null, "selected_gene": ["CD4", "CD8A", "CD8B", "CD19", "CTLA4", "TIGIT", "GNG4", "GNG8", "CDK1"], "time_spend": 23.282064827283225}, "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 166], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "sequential_11", "class_name": "Sequential", "config": {"name": "sequential_11", "layers": [{"class_name": "Dense", "config": {"name": "s/dense1", "trainable": true, "batch_input_shape": [null, 166], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "s/dense2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "s/dense3", "trainable": true, "dtype": "float32", "units": 166, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["sequential_11", 1, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}